import React from "react";

function Algorithms() {
  const BSP_Info = `האלגוריתם משמש ליצירה של מפת המשחק בצורה פרוצדורלית, 
המפה מתחילה בתור מרחב אחד גדול, והאלגוריתם מחלק אותו לשני חלקים, 
לאחר מכן האלגוריתם מחלק כל מרחב שנוצר לשניים עד שכל מרחב מגיע לגודל המינימלי המותר, 
וכך מסתיימת החלוקה. מהמרחבים שנוצרו אנו יוצרים את החדרים המרכיבים את מפת המשחק.`;
  return (
    <>
      <div>
        <h3>אלגוריתמים</h3>
        <p>האלגוריתמים הראשיים הנמצאים כרגע במשחק</p>
      </div>
      <div>
        <h4>Binary Space partitioning</h4>
        <h4>חלוקת מרחב בינארית</h4>
        <p>{BSP_Info}</p>
        <p>סיבוכיות זמן הריצה היא O(nLogn)</p>
      </div>
    </>
  );
}

export default Algorithms;
